Revit 2027 API
BuiltInFailures.FamilyFailures.CircularRefsForInstParams Property
 "Instance parameter '%1!s!' generates circular references."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircularRefsForInstParams { get; }
Public Shared ReadOnly Property CircularRefsForInstParams As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircularRefsForInstParams {
	FailureDefinitionId^ get ();
}
static member CircularRefsForInstParams : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace